Revit 2027 API
UIMacroManager Properties
The UIMacroManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroManager |  The DB macro manager.
Top
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace